api/app/controllers/users_controller.rb

INSERT INTO "users" ("username", "email", "password_digest", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["username", "johndoe"], ["email", "email"], ["password_digest", "[FILTERED]"], ["created_at", "2023-03-23 07:49:08.687193"], ["updated_at", "2023-03-23 07:49:08.687193"]]
---
    def register
        user = User.create(user_params)

SELECT "users".* FROM "users" WHERE (username = 'johndoe' OR email = 'email') ORDER BY "users"."id" ASC LIMIT ?  [["LIMIT", 1]]
---
    def login
        sql = "username = :username OR email = :email"
        user = User.where(sql, { username: user_params[:username], email: user_params[:email] }).first